app/controllers/books_controller.rb

def create
  @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "ra"], ["created_at", "2021-09-15 10:36:27.286696"], ["updated_at", "2021-09-15 10:36:27.286696"]]
SELECT "books".* FROM "books"